{
    "name": "Kenny McCormick",
    "desc": "Kenneth “Kenny” McCormick[2] is one of the four main characters in the adult animated television series South Park along with Stan Marsh, Kyle Broflovski, and Eric Cartman. His often muffled and incomprehensible speech – the result of his parka hood covering his mouth – is provided by co-creator Matt Stone. He debuted on television when South Park first aired on August 13, 1997, after having first appeared in The Spirit of Christmas shorts created by Stone and long-time collaborator Trey Parker in 1992 (Jesus vs. Frosty) and 1995 (Jesus vs. Santa).Kenny is a third, later fourth-grade student who commonly has extraordinary experiences not typical of conventional small-town life in his hometown of South Park, Colorado, where he lives with his poverty-stricken family. Kenny is animated by computer to look as he did in the show's original method of cutout animation. He also appears in the 1999 full-length feature film South Park: Bigger, Longer & Uncut, in which his true appearance and voice were first revealed, and various South Park merchandise. Kenny has gained a lot of popularity thanks to a running gag most prevalent during the first five seasons of the series, in which Kenny would suffer an excruciating death before returning alive and well in the next episode with little or no explanation. Stan would frequently use the catchphrase 'Oh, my God! They killed Kenny!', followed by Kyle exclaiming 'You bastards!'. Since the show began its sixth season in 2002, the practice of killing Kenny has been seldom used by the show's creators, although he did eventually possess Eric Cartman's body for 4 episodes. Various episodes have set up the gag, sometimes presenting a number of explanations for Kenny's unacknowledged reappearances. Kenny is known for his iconic outfit of a orange jacket and brown mittens, Kenny’s way of communication is not understood by the rest of the characters. This was a send-up of the gag, in the episode 'Mysterion Rises'. Various episodes have presented other explanations of Kenny's resurrections, but we know in a real-world perspective that the real reason is that it's a running joke. In the episode 'Mysterion Rises,' it is found that Kenny actually has the superpower of resurrection, claiming that no matter how many times he's died, he always wakes up in his bed the next day wearing his usual clothes. He also states that none of his peers or family can remember him dying whatsoever. However, in some episodes, the other kids can recall Kenny being killed and mention how he died all the time. Kenny died in every episode up to season 5. After this, Kenny only dies sometimes.",
    "image": "c2"
  },
