[
  {
    "name": "EricCartman",
    "desc": "Eric Theodore Cartman, often referred to just by his surname,[1] is the main character in the adult animated television series South Park, created by Matt Stone and Trey Parker, and is voiced by Parker. He is one of the series' four central characters, along with Stan Marsh, Kyle Broflovski, and Kenny McCormick, though he is considered the main character of the show. A prototypical version of Cartman (called Kenny) first appeared in the 1992 animated short, Jesus vs. Frosty, later appearing in the 1995 animated short Jesus vs. Santa, and first appeared on television in the pilot episode of South Park, 'Cartman Gets an Anal Probe', on August 13, 1997.Cartman is an elementary school student who lives with his mother in the fictional town of South Park, Colorado, where he routinely has extraordinary experiences atypical of a small town. Cartman is aggressive, savage, prejudiced, arrogant and narcissistic since his character's inception, being described by Stone and Parker as 'a little Archie Bunker'. In later seasons, Cartman begins to exhibit extremely psychopathic, sociopathic and manipulative behavior, particularly in episodes such as 'Scott Tenorman Must Die' and also is highly intelligent, able to execute morally appalling plans and business ideas with success, but most of them usually end up in failure and humiliation due to someone (usually either Stan or Kyle, or both) or something (e.g. a myrrh record award, rather than a platinum record award, in 'Christian Rock Hard') that ruins his schemes.Cartman is considered by prominent publications and television channels to be the most popular and famous character on South Park, one of the most influential characters in cartoon and television history, and an American cultural icon.[2][3][4] Parker and Stone state that he is their favorite character, and the one with whom they most identify. South Park has received both praise and criticism for Cartman's politically incorrect behavior.",
    "image": "c1"
  },
  {
    "name": "Kenny McCormick",
    "desc": "Kenneth “Kenny” McCormick[2] is one of the four main characters in the adult animated television series South Park along with Stan Marsh, Kyle Broflovski, and Eric Cartman. His often muffled and incomprehensible speech – the result of his parka hood covering his mouth – is provided by co-creator Matt Stone. He debuted on television when South Park first aired on August 13, 1997, after having first appeared in The Spirit of Christmas shorts created by Stone and long-time collaborator Trey Parker in 1992 (Jesus vs. Frosty) and 1995 (Jesus vs. Santa).Kenny is a third, later fourth-grade student who commonly has extraordinary experiences not typical of conventional small-town life in his hometown of South Park, Colorado, where he lives with his poverty-stricken family. Kenny is animated by computer to look as he did in the show's original method of cutout animation. He also appears in the 1999 full-length feature film South Park: Bigger, Longer & Uncut, in which his true appearance and voice were first revealed, and various South Park merchandise. Kenny has gained a lot of popularity thanks to a running gag most prevalent during the first five seasons of the series, in which Kenny would suffer an excruciating death before returning alive and well in the next episode with little or no explanation. Stan would frequently use the catchphrase 'Oh, my God! They killed Kenny!', followed by Kyle exclaiming 'You bastards!'. Since the show began its sixth season in 2002, the practice of killing Kenny has been seldom used by the show's creators, although he did eventually possess Eric Cartman's body for 4 episodes. Various episodes have set up the gag, sometimes presenting a number of explanations for Kenny's unacknowledged reappearances. Kenny is known for his iconic outfit of a orange jacket and brown mittens, Kenny’s way of communication is not understood by the rest of the characters. This was a send-up of the gag, in the episode 'Mysterion Rises'. Various episodes have presented other explanations of Kenny's resurrections, but we know in a real-world perspective that the real reason is that it's a running joke. In the episode 'Mysterion Rises,' it is found that Kenny actually has the superpower of resurrection, claiming that no matter how many times he's died, he always wakes up in his bed the next day wearing his usual clothes. He also states that none of his peers or family can remember him dying whatsoever. However, in some episodes, the other kids can recall Kenny being killed and mention how he died all the time. Kenny died in every episode up to season 5. After this, Kenny only dies sometimes.",
    "image": "c2"
  },
  {
    "name": "Kyle Broflovski",
    "desc": "Kyle Broflovski[a] is one of the four main characters in adult animated television series South Park. He is voiced by and loosely based on co-creator Matt Stone. Kyle is one of the series' four central characters, along with his friends Stan Marsh, Kenny McCormick, and Eric Cartman. He debuted on television when South Park first aired on August 13, 1997, after having first appeared in The Spirit of Christmas shorts created by Stone and long-time collaborator Trey Parker in 1992 (Jesus vs. Frosty) and 1995 (Jesus vs. Santa). Kyle is an elementary school student who commonly has extraordinary experiences not typical of conventional small-town life in his fictional hometown of South Park, Colorado. Kyle is distinctive as one of the few Jewish children on the show, and because of this, he often feels like an outsider amongst the core group of characters. His portrayal in this role is often dealt with satirically, and has elicited both praise and criticism from Jewish viewers. Like the other South Park characters, Kyle is animated by computer in a way to emulate the show's original method of cutout animation. He also appears in the 1999 full-length feature film South Park: Bigger, Longer & Uncut, as well as South Park-related media and merchandise. While Parker and Stone portray Kyle as having common childlike tendencies, his dialogue is often intended to reflect stances and views on more adult-oriented issues, and has been cited in numerous publications by experts in the fields of politics, religion, popular culture, and philosophy.",
    "image":"c3"
  },
  {
    "name": "Stan Marsh",
    "desc": "Stanley 'Stan' Marsh is one of the four main characters of the adult animated television series South Park. He is voiced by and loosely based on series co-creator Trey Parker. Stan is one of the series' four central characters, along with Kyle Broflovski, Eric Cartman, and Kenny McCormick. He debuted on television when South Park first aired on August 13, 1997, after having first appeared in The Spirit of Christmas shorts created by Parker and long-time collaborator Matt Stone in 1992 (Jesus vs. Frosty) and 1995 (Jesus vs. Santa). Stan is an elementary school student who commonly has extraordinary experiences not typical of conventional small-town life in his fictional hometown of South Park, Colorado. Stan is generally depicted as logical, brave, patient and sensitive. He is outspoken in expressing his distinct lack of esteem for adults and their influences, as adult South Park residents rarely make use of their critical faculties. Like the other South Park characters, Stan is animated by computer in a way to emulate the show's original method of cutout animation. He also appears in the full-length feature film South Park: Bigger, Longer & Uncut (1999), as well as South Park-related media and merchandise. While Parker and Stone portray Stan as having common childlike tendencies, his dialogue is often intended to reflect stances and views on more adult-oriented issues and has been frequently cited in numerous publications by experts in the fields of politics, religion, popular culture and philosophy.",
    "image": "c4"
  }
]
